DROP TABLE IF EXISTS `tdept`;
CREATE TABLE `tdept` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `dept_id` varchar(50) COLLATE utf8_bin DEFAULT '',
  `dept_code` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `dept_name` text COLLATE utf8_bin,
  `short_dept_name` varchar(50) COLLATE utf8_bin DEFAULT '',
  `dm` int(11) DEFAULT '0',
  `yjdm` int(11) DEFAULT '0',
  `hydm` int(11) DEFAULT '0',
  `full_dept_name` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  `ydjcj` int(11) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=215 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

-- ----------------------------
--  Records of `tdept`
-- ----------------------------
BEGIN;
INSERT INTO `tdept` VALUES ('1', 'D0001', '', '邗江分局', '邗江分局', '0', '0', '0', '扬州市公安局邗江分局', '21'), ('2', 'D0055', '', ' 办公室', '办公室', '0', '0', '0', null, '0'), ('3', 'D0048', '', '指挥中心', '指挥中心', '0', '0', '0', null, '0'), ('5', 'D0018', '', '刑警大队', '刑警', '0', '1', '0', null, '0'), ('6', 'D0011', '', '治安大队', '治安', '0', '0', '0', null, '0'), ('7', 'D0032', '', '交警大队', '交警', '0', '1', '1', null, '0'), ('8', 'D0057', '', '督察大队', '督察', '0', '0', '0', null, '0'), ('9', 'D0047', '', '法制大队', '法制', '0', '0', '0', null, '0'), ('100', 'D0059', '', '邗上派出所', '邗上', '0', '1', '1', '扬州市公安局邗江分局邗上派出所', '1'), ('101', 'D0068', '', '汊河派出所', '汊河', '0', '1', '1', '扬州市公安局邗江分局汊河派出所', '2'), ('102', 'D0191', '', '念四桥派出所', '念四桥', '0', '1', '1', '扬州市公安局邗江分局念四桥派出所', '11'), ('103', 'D0181', '', '四季园派出所', '四季园', '0', '1', '1', '扬州市公安局邗江分局四季园派出所', '10'), ('104', 'D0220', '', '西湖派出所', '西湖', '0', '1', '1', '扬州市公安局邗江分局西湖派出所', '13'), ('105', 'D00003', '', '新盛派出所', '新盛', '0', '1', '1', '扬州市公安局邗江分局新盛派出所', '16'), ('106', 'D0086', '', '蒋王派出所', '蒋王', '0', '1', '1', '扬州市公安局邗江分局蒋王派出所', '4'), ('107', 'D0238', '', '江阳派出所', '江阳', '0', '1', '1', '扬州市公安局邗江分局江阳派出所', '14'), ('108', 'D0112', '', '方巷派出所', '方巷', '0', '1', '1', '扬州市公安局邗江分局方巷派出所', '7'), ('109', 'D0245', '', '甘泉派出所', '甘泉', '0', '1', '1', '扬州市公安局邗江分局甘泉派出所', '15'), ('110', 'D0122', '', '公道派出所', '公道', '0', '1', '1', '扬州市公安局邗江分局公道派出所', '8'), ('111', 'D0078', '', '瓜洲派出所', '瓜洲', '0', '1', '1', '扬州市公安局邗江分局瓜洲派出所', '3'), ('112', 'D0102', '', '槐泗派出所', '槐泗', '0', '1', '1', '扬州市公安局邗江分局槐泗派出所', '6'), ('113', 'D0209', '', '竹西派出所', '竹西', '0', '1', '1', '扬州市公安局邗江分局竹西派出所', '12'), ('114', 'D0095', '', '杨庙派出所', '杨庙', '0', '1', '1', '扬州市公安局邗江分局杨庙派出所', '5'), ('115', 'D0173', '', '杨寿派出所', '杨寿', '0', '1', '1', '扬州市公安局邗江分局杨寿派出所', '9'), ('200', 'D0050', '', '巡特警大队', '巡特警', '0', '1', '0', null, '0'), ('210', 'D0044', '', '汊河交警中队', '汊河中队', '0', '1', '0', null, '0'), ('211', 'D0040', '', '方巷交警中队', '方巷中队', '0', '1', '0', '扬州市公安局邗江分局甘泉交警中队', '20'), ('212', 'D0039', '', '甘泉交警中队', '甘泉中队', '0', '1', '0', '扬州市公安局邗江分局方巷交警中队', '19'), ('213', 'D0038', '', '公道交警中队', '公道中队', '0', '1', '0', '扬州市公安局邗江分局公道交警中队', '18'), ('214', 'D0037', '', '瓜州交警中队', '瓜州中队', '0', '1', '0', '扬州市公安局邗江分局瓜洲交警中队', '17');
COMMIT;

DROP TABLE IF EXISTS `tsqmj`;
CREATE TABLE `tsqmj` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `police` varchar(50) DEFAULT NULL,
  `police_id` varchar(50) DEFAULT NULL,
  `police_code` varchar(50) DEFAULT NULL,
  `djj` varchar(50) DEFAULT NULL,
  `short_phone` varchar(50) DEFAULT NULL,
  `dept_id` varchar(50) DEFAULT NULL,
  `dept_code` varchar(50) DEFAULT NULL,
  `dept_name` varchar(50) DEFAULT NULL,
  `is_leader` int(11) DEFAULT '-1',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=183 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Records of `tsqmj`
-- ----------------------------
BEGIN;
INSERT INTO `tsqmj` VALUES ('99', '葛蔓林', 'P000493', '104698', '51430488', null, 'D0122', '32100358', '公道派出所', '-1'), ('100', '吴涵', '10327', '104367', '51430782', null, 'D0059', '32100351', '邗上派出所', '-1'), ('101', '兰雪雅', '10332', '104382', '51430783', null, 'D0059', '32100351', '邗上派出所', '-1'), ('102', '贾晓雪', '10326', '104684', '51430784', null, 'D0059', '32100351', '邗上派出所', '-1'), ('103', '任格', 'P000347', '103339', '51430792', null, 'D0059', '32100351', '邗上派出所', '-1'), ('104', '叶超', '10358', '104589', '51430785', null, 'D0059', '32100351', '邗上派出所', '-1'), ('105', '陈佳', 'P000162', '104708', '51430786', null, 'D0059', '32100351', '邗上派出所', '-1'), ('106', '魏丽媛', '10356', '104581', '51430787', null, 'D0059', '32100351', '邗上派出所', '-1'), ('107', '蒋霞', '10334', '104372', '51430788', null, 'D0059', '32100351', '邗上派出所', '-1'), ('108', '周培', '10333', '104421', '51430790', null, 'D0059', '32100351', '邗上派出所', '-1'), ('109', '管凯', '10461', '104686', '51430489', null, 'D0122', '32100358', '公道派出所', '-1'), ('110', '葛君', 'P000044', '104592', '51430564', null, 'D0102', '32100356', '槐泗派出所', '-1'), ('111', '张政', '10445', '104661', '51430567', null, 'D0102', '32100356', '槐泗派出所', '-1'), ('112', '陈忠良', '10437', '104480', '51430562', null, 'D0102', '32100356', '槐泗派出所', '-1'), ('113', '卞泽俊', '10439', '104490', '51430566', null, 'D0102', '32100356', '槐泗派出所', '-1'), ('114', '陈玉明', '10518', '103207', '51430666', null, 'D0191', '32100366', '念四桥派出所', '-1'), ('115', '彭正亮', '10529', '100854', '51430674', null, 'D0191', '32100366', '念四桥派出所', '-1'), ('116', '严永亭', '10471', '104504', '51430486', null, 'D0122', '32100358', '公道派出所', '-1'), ('117', '康元龙', '10520', '102309', '51430668', null, 'D0191', '32100366', '念四桥派出所', '-1'), ('118', '王峰', '10530', '103080', '51430675', null, 'D0191', '32100366', '念四桥派出所', '-1'), ('119', '杨志刚', '10527', '103294', '51430672', null, 'D0191', '32100366', '念四桥派出所', '-1'), ('120', '陆羽佳', '10511', '104690', '51430661', null, 'D0191', '32100366', '念四桥派出所', '-1'), ('121', '周岂凡', 'P000171', '104711', '51430735', null, 'D00003', '32100373', '新盛派出所', '-1'), ('122', '郭同尧', 'P000104', '103044', '51430728', null, 'D00003', '32100373', '新盛派出所', '-1'), ('123', '张  凯', 'P000284', '104735', '51430734', null, 'D00003', '32100373', '新盛派出所', '-1'), ('124', '龚  华', 'P000510', '100485', '51430732', null, 'D00003', '32100373', '新盛派出所', '-1'), ('125', '卜春华', 'P000097', '100356', '51430727', null, 'D00003', '32100373', '新盛派出所', '-1'), ('126', '任长春', '10467', '104513', '51430485', null, 'D0122', '32100358', '公道派出所', '-1'), ('127', '谭江峰', 'P000102', '100614', '51430729', null, 'D00003', '32100373', '新盛派出所', '-1'), ('128', '周  明', '10383', '104568', '51430822', null, 'D0068', '32100352', '汊河派出所', '-1'), ('129', '江柠君', 'P000592', '104110', '51430834', null, 'D0068', '32100352', '汊河派出所', '-1'), ('130', '吴鹏程', 'P000052', '104532', '51430829', null, 'D0068', '32100352', '汊河派出所', '-1'), ('131', '王  瑜', '10391', '104180', '51430826', null, 'D0068', '32100352', '汊河派出所', '-1'), ('132', '张  杰', '10375', '104399', '51430828', null, 'D0068', '32100352', '汊河派出所', '-1'), ('133', '刘明扬', '10369', '104683', '51430836', null, 'D0068', '32100352', '汊河派出所', '-1'), ('135', '吴金玲', 'P000506', '104773', '51430832', null, 'D0068', '32100352', '汊河派出所', '-1'), ('136', '王岭', 'P000357', '104649', '51430484', null, 'D0122', '32100358', '公道派出所', '-1'), ('137', '介新宇', 'P000110', '104254', '51430830', null, 'D0068', '32100352', '汊河派出所', '-1'), ('138', '陈厚信', '10453', '104496', '51430526', null, 'D0112', '32100357', '方巷派出所', '-1'), ('139', '王浩', 'P000505', '104582', '51430530', null, 'D0112', '32100357', '方巷派出所', '-1'), ('140', '汤健', 'P000045', '104455', '51430522', null, 'D0112', '32100357', '方巷派出所', '-1'), ('141', '范正宝', '10456', '104528', '51430528', null, 'D0112', '32100357', '方巷派出所', '-1'), ('142', '宋春荣', '10621', '104537', '51430544', null, 'D0245', '32100372', '甘泉派出所', '-1'), ('143', '王志海', '10623', '103280', '51430545', null, 'D0245', '32100372', '甘泉派出所', '-1'), ('144', '颜兆友', '10622', '104489', '51430546', null, 'D0245', '32100372', '甘泉派出所', '-1'), ('145', '俞贞宝', '10611', '103152', '51430585', null, 'D0238', '32100371', '江阳派出所', '-1'), ('146', '汤晓峰', 'P000343', '104361', '51430854', null, 'D0078', '32100353', '瓜洲派出所', '-1'), ('147', '施圣斌', '10609', '103155', '51430586', null, 'D0238', '32100371', '江阳派出所', '-1'), ('148', '张智勇', '10607', '100768', '51430581', null, 'D0238', '32100371', '江阳派出所', '-1'), ('149', '辛丙甲', 'P000418', '103414', '51430589', null, 'D0238', '32100371', '江阳派出所', '-1'), ('150', '李兴龙', '10416', '104374', '51430808', null, 'D0086', '32100354', '蒋王派出所', '-1'), ('151', '吴浪', '10405', '104295', '51430806', null, 'D0086', '32100354', '蒋王派出所', '-1'), ('152', '陈曦', 'P000395', '104764', '51430814', null, 'D0086', '32100354', '蒋王派出所', '-1'), ('153', '焦世栋', 'P000369', '104747', '51430813', null, 'D0086', '32100354', '蒋王派出所', '-1'), ('154', '张炜', 'P000336', '104753', '51430810', null, 'D0086', '32100354', '蒋王派出所', '-1'), ('155', '储丽娟', '10407', '104025', '51430801', null, 'D0086', '32100354', '蒋王派出所', '-1'), ('156', '田春雨', '10574', '104553', '51430639', null, 'D0220', '32100369', '西湖派出所', '-1'), ('157', '许永明', '10394', '104663', '51430858', null, 'D0078', '32100353', '瓜洲派出所', '-1'), ('158', '童占抗', 'P000600', '104217', '51430638', null, 'D0220', '32100369', '西湖派出所', '-1'), ('159', '王伟', '10581', '103258', '51430649', null, 'D0220', '32100369', '西湖派出所', '-1'), ('160', '肖慧明', '10585', '100840', '51430654', null, 'D0220', '32100369', '西湖派出所', '-1'), ('161', '孔祥明', '10577', '103129', '51430652', null, 'D0220', '32100369', '西湖派出所', '-1'), ('162', '姚永东', '10579', '103209', '51430647', null, 'D0220', '32100369', '西湖派出所', '-1'), ('163', '张钟', '10580', '103257', '51430648', null, 'D0220', '32100369', '西湖派出所', '-1'), ('164', '马晓峰', 'P000549', '101229', '51430691', null, 'D0181', '32100365', '四季园派出所', '-1'), ('165', '马晓峰', 'P000553', '101229', '51430691', null, 'D0181', '32100365', '四季园派出所', '-1'), ('166', '陈璐', '10504', '100754', '51430711', null, 'D0181', '32100365', '四季园派出所', '-1'), ('167', '王根栋', '10496', '103131', '51430706', null, 'D0181', '32100365', '四季园派出所', '-1'), ('168', '高维凡', '10399', '104360', '51430852', null, 'D0078', '32100353', '瓜洲派出所', '-1'), ('169', '任延吉', 'P000195', '104653', '51430699', null, 'D0181', '32100365', '四季园派出所', '-1'), ('170', '王惠忠', '10429', '104546', '51430627', null, 'D0095', '32100355', '杨庙派出所', '-1'), ('171', '黄大明', 'P000115', '104637', '51430625', null, 'D0095', '32100355', '杨庙派出所', '-1'), ('172', '房友', 'P000354', '104647', '51430623', null, 'D0095', '32100355', '杨庙派出所', '-1'), ('173', '张金键', 'P000053', '104433', '51430503', null, 'D0173', '32100364', '杨寿派出所', '-1'), ('174', '朱家林', '10478', '104509', '51430509', null, 'D0173', '32100364', '杨寿派出所', '-1'), ('175', '贡亚男', '10367', '104634', '51430789', null, 'D0059', '32100351', '邗上派出所', '-1'), ('176', '严先亮', '10477', '104540', '51430507', null, 'D0173', '32100364', '杨寿派出所', '-1'), ('177', '房红兵', '10472', '104696', '51430504', null, 'D0173', '32100364', '杨寿派出所', '-1'), ('178', '房红兵', 'P000363', '104696', '51430504', null, 'D00003', '32100373', '新盛派出所', '-1'), ('180', '王天鹏', '10563', '103255', '51430608', null, 'D0209', '32100368', '竹西派出所', '-1'), ('181', '杨波', 'P000117', '103204', '51430602', null, 'D0209', '32100368', '竹西派出所', '-1'), ('182', '唐其峰', 'P000164', '100219', '51430605', null, 'D0209', '32100368', '竹西派出所', '-1');
COMMIT;


DROP TABLE IF EXISTS `tsb`;
CREATE TABLE `tsb` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `sbbh` varchar(50) DEFAULT NULL,
  `sblx` varchar(50) DEFAULT NULL,
  `jrlx` varchar(50) DEFAULT NULL,
  `sxdw` varchar(50) DEFAULT NULL,
  `szwz` varchar(50) DEFAULT NULL,
  `jgh` varchar(50) DEFAULT NULL,
  `sbghs` varchar(50) DEFAULT NULL,
  `wbdh` varchar(50) DEFAULT NULL,
  `glzzr` varchar(50) DEFAULT NULL,
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP,
  `create_by` varchar(50) DEFAULT NULL,
  `pzwjdz` varchar(255) DEFAULT NULL,
  `isdel` int(11) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=41 DEFAULT CHARSET=utf8;

DROP TABLE IF EXISTS `tdk`;
CREATE TABLE `tdk` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `sb_id` int(11) DEFAULT NULL,
  `dklx` varchar(50) DEFAULT NULL,
  `bkh` varchar(50) DEFAULT NULL,
  `dkh` varchar(50) DEFAULT NULL,
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP,
  `create_by` varchar(50) DEFAULT NULL,
  `isdel` int(11) DEFAULT '0',
  PRIMARY KEY (`id`),
  KEY `idx_sbid` (`sb_id`)
) ENGINE=InnoDB AUTO_INCREMENT=36 DEFAULT CHARSET=utf8;

DROP TABLE IF EXISTS `txl`;
CREATE TABLE `txl` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `xlbh` varchar(50) DEFAULT NULL,
  `sl_dk_id` int(11) DEFAULT NULL,
  `xl_dk_id` int(11) DEFAULT NULL,
  `ljlx` varchar(50) DEFAULT NULL,
  `vlan` varchar(50) DEFAULT NULL,
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP,
  `create_by` varchar(50) DEFAULT NULL,
  `isdel` int(11) DEFAULT '0',
  `sl_sb_id` int(11) DEFAULT NULL,
  `xl_sb_id` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=29 DEFAULT CHARSET=utf8;

DROP TABLE IF EXISTS `tydjcj`;
CREATE TABLE `tydjcj` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `dw` varchar(50) DEFAULT NULL,
  `zjql` int(11) DEFAULT NULL,
  `xptjjl` int(11) DEFAULT NULL,
  `xptjjlv` int(50) DEFAULT NULL,
  `zcjdj` int(11) DEFAULT NULL,
  `xptzmdcjdj` int(11) DEFAULT NULL,
  `xptyddcjdj` int(11) DEFAULT NULL,
  `xptcjlv` int(50) DEFAULT NULL,
  `dept_code` varchar(50) DEFAULT NULL,
  `dept_id` varchar(255) DEFAULT NULL,
  `create_time` datetime DEFAULT CURRENT_TIMESTAMP,
  `user_id` varchar(255) DEFAULT NULL,
  `lptjjl` int(11) DEFAULT NULL,
  `ydjcj_date` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=379 DEFAULT CHARSET=utf8;


